In [1]:
import pandas as pd

In [5]:
df=pd.read_csv('landprices.csv')
df

         area   price
0    Ameerpet    2000
1     SRNagar    3000
2     Miyapur    4000
3    Moosapet    5000
4          KP    6000
5        KPHB    7000
6  HitechCity  800000

In [6]:
df.describe()

               price
count       7.000000
mean   118142.857143
std    300675.588507
min      2000.000000
25%      3500.000000
50%      5000.000000
75%      6500.000000
max    800000.000000